{"latest-headlines": [{"id": 1, "headline": "Amit Shah lays foundation for Beej Anusandhan Kendra at IFFCO Kalol unit", "summary": "Amit Shah lays foundation for Beej Anusandhan Kendra at IFFCO Kalol unit. Ahmedabad: Union home and cooperation minister Amit Shah on Saturday laid the foundation stone for the Beej Anusandhan Kendra, a seed research centre to boost agricultural productivity and innovation, at the Indian Farmers Fertiliser Cooperative Limited (IFFCO) Kalol unit in Gujarat’s Gandhinagar  Union home minister Amit Shah at the golden jubilee celebrations of IFFCO's parent unit in Gandhinagar (Bhupendrapbjp-X) “Earlier, fertilizers were high in cost and low in efficiency", "url": "https://www.hindustantimes.com/india-news/amit-shah-lays-foundation-for-beej-anusandhan-kendra-at-iffco-kalol-unit-101743955663588.html", "audio_url": "", "source": "Hindustan Times", "timestamp": "2025-04-07T09:31:05.410603", "category": "politics-global-affairs"}, {"id": 2, "headline": "Sensex, Nifty crash over Trump tariff shock, ‘Black Monday’ fears", "summary": "Sensex, Nifty crash over Trump tariff shock, ‘Black Monday’ fears. Indian share markets crashed on Monday as global trade war and growing recession fears in the US triggered a stock market rout on Wall Street and in other Asian markets  A bird flies past a screen displaying the Sensex results on the facade of the Bombay Stock Exchange (BSE) building in Mumbai", "url": "https://www.hindustantimes.com/india-news/sensex-nifty-crash-over-trump-tariff-shock-black-monday-fears-101743997876634.html", "audio_url": "", "source": "Hindustan Times", "timestamp": "2025-04-07T09:31:06.717478", "category": "politics-global-affairs"}, {"id": 3, "headline": "Heatwave warning for Delhi, other states; 'red alert' issued for Rajasthan", "summary": "Heatwave warning for Delhi, other states; 'red alert' issued for Rajasthan. The maximum temperature in Delhi reached 38 2 degree Celsius on Sunday, around three notches above the seasonal average, said the India Meteorological Department (IMD)", "url": "https://www.hindustantimes.com/india-news/heatwave-warning-for-delhi-other-states-red-alert-issued-for-rajasthan-check-this-weeks-forecast-101743990355038.html", "audio_url": "", "source": "Hindustan Times", "timestamp": "2025-04-07T09:31:07.953413", "category": "technology-innovation"}, {"id": 4, "headline": "Diverse collectors, matured context and the renewed interest in South Asian art", "summary": "Diverse collectors, matured context and the renewed interest in South Asian art. What is going on with South Asian art? A lot if you have been following the secondary art market and auctions  In the past few weeks alone, we have seen the price threshold of major Indian artists being reset", "url": "https://www.hindustantimes.com/india-news/diverse-collectors-matured-context-and-the-renewed-interest-in-south-asian-art-101743995998796.html", "audio_url": "", "source": "Hindustan Times", "timestamp": "2025-04-07T09:31:09.409704", "category": "politics-global-affairs"}, {"id": 5, "headline": "20-year-old student suffers heart attack mid-speech in Maharashtra, dies", "summary": "20-year-old student suffers heart attack mid-speech in Maharashtra, dies. A college event in Maharashtra’s Dharashiv city turned tragic after a 20-year-old student collapsed while delivering a speech and later died of a heart attack, with a video of the incident now viral  Varsha Kharat, a 20-year-old student, moments before collapsing during her speech at a college event", "url": "https://www.hindustantimes.com/india-news/20yearold-college-student-suffers-heart-attack-mid-speech-in-maharashtra-s-dharashiv-dies-video-101743990032080.html", "audio_url": "", "source": "Hindustan Times", "timestamp": "2025-04-07T09:31:10.656537", "category": "politics-global-affairs"}, {"id": 6, "headline": "Gokhale Institute's parent body secretary held for fund 'misappropriation'", "summary": "Gokhale Institute's parent body secretary held for fund 'misappropriation'. Pune, Police have arrested the secretary of the Servants of India Society, the parent body of the prestigious Gokhale Institute of Politics and Economics here, for alleged misappropriation of funds and cheating, an official said  Gokhale Institute's parent body secretary held for fund 'misappropriation' Milind Deshmukh was arrested on Saturday on a complaint by GIPE's deputy registrar Vishal Gaikwad, the Deccan Gymkhana police station official said on Sunday", "url": "https://www.hindustantimes.com/india-news/gokhale-institute-s-parent-body-secretary-held-for-fund-misappropriation-101743994377433.html", "audio_url": "", "source": "Hindustan Times", "timestamp": "2025-04-07T09:31:11.841496", "category": "politics-global-affairs"}, {"id": 7, "headline": "Badminton coach held for raping 16-year-old student: Police", "summary": "Badminton coach held for raping 16-year-old student: Police. A 30-year-old badminton coach has been arrested by the Hulimavu police in Bengaluru for allegedly sexually assaulting a 16-year-old girl during the training sessions, police said on Sunday  Badminton coach held for raping 16-year-old student: Police South east deputy commissioner of police (DCP) Sara Fathima said that a case was registered on Thursday under the Protection of children from sexual offences (Pocso) Act on the basis of a complaint filed by a woman stating that her daughter was raped multiple times “The girl, a student at a private school awaiting her exam results, was reportedly at her grandmother’s residence when some nude photographs of her were sent to her grandmother’s mobile phone from unknown numbers", "url": "https://www.hindustantimes.com/india-news/badminton-coach-held-for-raping-16-year-old-student-police-101743968208290.html", "audio_url": "", "source": "Hindustan Times", "timestamp": "2025-04-07T09:31:13.073736", "category": "technology-innovation"}, {"id": 8, "headline": "JD(S) holds meet to discuss upcoming local polls, HDK declares ‘war on Sidda and DKS’", "summary": "JD(S) holds meet to discuss upcoming local polls, HDK declares ‘war on Sidda and DKS’. Ahead of the taluk and zilla panchayat elections, the Janata Dal (Secular) convened its core committee meeting at the residence of Union minister and party state president HD Kumaraswamy  However, core committee chief GT Devegowda did not attend the meeting, who has kept a distance from Kumaraswamy in recent weeks", "url": "https://www.hindustantimes.com/india-news/jds-holds-meet-to-discuss-upcoming-local-polls-hdk-declares-war-on-sidda-and-dks-101743968088447.html", "audio_url": "", "source": "Hindustan Times", "timestamp": "2025-04-07T09:31:14.261790", "category": "politics-global-affairs"}, {"id": 9, "headline": "Police: 1 killed in granite quarry blast in Raichur", "summary": "Police: 1 killed in granite quarry blast in Raichur. A 38-year-old man was killed and another critically injured in an explosion at a granite quarry near Makapur village in Lingasugur taluk, police said  The injured worker, identified as 40-year-old Mahalinga from Kushtagi in Koppal district, was rushed to a local hospital and later shifted to Bagalkote for advanced treatment", "url": "https://www.hindustantimes.com/india-news/police-1-killed-in-granite-quarry-blast-in-raichur-101743967967846.html", "audio_url": "", "source": "Hindustan Times", "timestamp": "2025-04-07T09:31:15.853709", "category": "politics-global-affairs"}, {"id": 10, "headline": "Man assaults woman inB’luru, probe on: Cops", "summary": "Man assaults woman inB’luru, probe on: Cops. Police has launched a search for an unidentified man who allegedly groped a woman while whe was walking wit her friend in the capital city, police said  Man assaults woman inB’luru, probe on: Cops “The incident took place on April 4 at around 2am", "url": "https://www.hindustantimes.com/india-news/man-assaults-woman-inb-luru-probe-on-cops-101743967907653.html", "audio_url": "", "source": "Hindustan Times", "timestamp": "2025-04-07T09:31:17.429741", "category": "technology-innovation"}, {"id": 1, "headline": "Trump's tariffs: Apple, Samsung to up dispatch of India-made stuff", "summary": "Trump's tariffs: Apple, Samsung to up dispatch of India-made stuff. Apple and Samsung are shifting their production to India to counter higher US tariffs on imports from China and Vietnam  This move aims to retain competitiveness in the US market, with Apple increasingly using Indian factories for iPhone shipments and Samsung also considering India as a temporary measure for its exports", "url": "https://timesofindia.indiatimes.com/business/india-business/trumps-tariffs-apple-samsung-to-up-dispatch-of-india-made-stuff/articleshow/120045331.cms", "audio_url": "", "source": "Times of India", "timestamp": "2025-04-07T09:31:19.161784", "category": "business-finance"}, {"id": 2, "headline": "India plans to set up nuclear submarine base in Andhra Pradesh next year", "summary": "India plans to set up nuclear submarine base in Andhra Pradesh next year. India will open a new naval base for nuclear submarines and warships in Andhra Pradesh next year  Upgrades to the Karwar base in Karnataka are also ongoing", "url": "https://timesofindia.indiatimes.com/india/india-plans-to-set-up-nuclear-submarine-base-in-andhra-pradesh-next-year/articleshow/120046893.cms", "audio_url": "", "source": "Times of India", "timestamp": "2025-04-07T09:31:19.161784", "category": "technology-innovation"}, {"id": 3, "headline": "Canadian PM Mark Carney visits BAPS Toronto Temple on Ram Navami", "summary": "Canadian PM Mark Carney visits BAPS Toronto Temple on Ram Navami. Prime Minister Mark Carney joined the Hindu community in Toronto for Ram Navami at the BAPS Shri Swaminarayan Mandir  Celebrating Lord Ram's birth, the event emphasized Hindu representation in Canada", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/canadian-pm-mark-carney-visits-baps-toronto-temple-on-ram-navami/articleshow/120048184.cms", "audio_url": "", "source": "Times of India", "timestamp": "2025-04-07T09:31:19.161784", "category": "politics-global-affairs"}, {"id": 4, "headline": "'Divine coincidence': PM Modi shares aerial video of Ram Setu", "summary": "'Divine coincidence': PM Modi shares aerial video of Ram Setu. PM Modi, returning from Sri Lanka, shared an aerial video of the Ram Setu and felt it was a divine coincidence that it aligned with the 'surya tilak' ceremony at the Ram temple in Ayodhya on Ram Navami  He extended warm greetings and highlighted Lord Ram's unifying force for the nation", "url": "https://timesofindia.indiatimes.com/india/divine-coincidence-pm-modi-shares-aerial-video-of-ram-setu/articleshow/120047993.cms", "audio_url": "", "source": "Times of India", "timestamp": "2025-04-07T09:31:19.162781", "category": "latest-headlines"}, {"id": 5, "headline": "Unknown entity faked docus: Younger Lodha brother’s firm", "summary": "Unknown entity faked docus: Younger Lodha brother’s firm. House of Abhinandan Lodha has reported to the police about forged documents used to change the names of its group companies, allegedly by an unknown entity  This follows Macrotech Developers' accusation of illegal 'Lodha' branding by the company, which is embroiled in a legal battle over the brand name", "url": "https://timesofindia.indiatimes.com/business/india-business/unknown-entity-faked-docus-younger-lodha-brothers-firm/articleshow/120048525.cms", "audio_url": "", "source": "Times of India", "timestamp": "2025-04-07T09:31:19.162781", "category": "business-finance"}, {"id": 6, "headline": "Consumer forums can issue detention orders, not arrest warrants: Calcutta HC", "summary": "Consumer forums can issue detention orders, not arrest warrants: Calcutta HC. Calcutta High Court clarified that consumer forums cannot issue arrest warrants like a criminal court, but can only order civil detention to enforce judgments  This arose from a case where an arrest warrant was wrongfully issued against a branch manager by the District Consumer Forum for an automobile payment dispute", "url": "https://timesofindia.indiatimes.com/india/consumer-forums-can-issue-detention-orders-not-arrest-warrants-calcutta-hc/articleshow/120045039.cms", "audio_url": "", "source": "Times of India", "timestamp": "2025-04-07T09:31:19.162781", "category": "technology-innovation"}, {"id": 7, "headline": "Waqf Act, Pahari quota, officers’ transfer set to raise J&K assembly temperature today", "summary": "Waqf Act, Pahari quota, officers’ transfer set to raise J&K assembly temperature today. The second part of the Jammu and Kashmir assembly budget session is set to be tumultuous over issues including the Waqf (Amendment) Act, the 10% reservation for the Pahari community, and the transfer of 48 administrative officers by Lt Governor Manoj Sinha  Opposition parties are challenging these decisions, calling for state autonomy", "url": "https://timesofindia.indiatimes.com/india/waqf-act-pahari-quota-officers-transfer-set-to-raise-jk-assembly-temperature-today/articleshow/120044746.cms", "audio_url": "", "source": "Times of India", "timestamp": "2025-04-07T09:31:19.162781", "category": "technology-innovation"}, {"id": 8, "headline": "Bengaluru man receives 'death threats' for booking a cab; here's why", "summary": "Bengaluru man receives 'death threats' for booking a cab; here's why. A Bengaluru commuter faced death threats from a group of aggressive auto drivers after choosing to book a bike cab via a ride-hailing app  The incident escalated as the auto drivers surrounded him and threatened violence", "url": "https://timesofindia.indiatimes.com/etimes/trending/bengaluru-man-receives-death-threats-for-booking-a-cab-heres-why/articleshow/120044432.cms", "audio_url": "", "source": "Times of India", "timestamp": "2025-04-07T09:31:19.162781", "category": "technology-innovation"}, {"id": 9, "headline": "'MS Dhoni should have retired a long time ago'", "summary": "'MS Dhoni should have retired a long time ago'. MS Dhoni, once renowned as Indian cricket's top 'finisher', is facing scrutiny in IPL 2025 after failing to deliver with the bat for three consecutive matches  Despite his sharp wicket-keeping skills, Dhoni's declining performance and strike rate are major concerns for the Chennai Super Kings, now at ninth place", "url": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ms-dhoni-should-have-retired-a-long-time-ago/articleshow/120041705.cms", "audio_url": "", "source": "Times of India", "timestamp": "2025-04-07T09:31:19.162781", "category": "technology-innovation"}, {"id": 10, "headline": "Saudi stock market faces worst loss in 5 years amid US tariffs: State media", "summary": "Saudi stock market faces worst loss in 5 years amid US tariffs: State media. The Saudi stock market suffered its worst daily drop in five years, falling 6 78% on Sunday", "url": "https://timesofindia.indiatimes.com/business/international-business/saudi-stock-market-faces-worst-loss-in-5-years-amid-us-tariffs-state-media/articleshow/120041428.cms", "audio_url": "", "source": "Times of India", "timestamp": "2025-04-07T09:31:19.162781", "category": "politics-global-affairs"}], "last_updated": "2025-04-07T09:31:19.164791", "updating": false}